Autodesk.Revit.DB.Electrical.AreaBasedLoadData.GetAnalyticalLoadScenariosData
Gets the electrical analytical load scenarios data.
Returns:
The electrical analytical load scenarios data.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.CanConnectToUpstreamNode(Autodesk.Revit.DB.ElementId)
Verifies that the area based load can connect to the upstream electrical analytical node.
If the area based load already has an upstream node or the upstream node is full of downstream nodes, the area based load can't connect to the upstream node.
Remarks:
If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
upstreamNodeId:
The upstream electrical analytical node id.
Returns:
True if the area based load can connect to the upstream electrical analytical node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.CanDisconnectFromUpstreamNode
Verifies that the area based load can disconnect from the upstream electrical analytical node.
If the area based load hasn't an upstream node, it can't disconnect from the upstream node.
Remarks:
If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
Returns:
True if the area based load can disconnect from the upstream electrical analytical node.
Since:
2024

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.DisconnectFromUpstreamNode
Disconnects from an upstream electrical analytical node.
Remarks:
If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The area based load can not disconnect from the upstream electrical analytical node.
Since:
2024

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.ConnectToUpstreamNode(Autodesk.Revit.DB.ElementId)
Connects to an upstream electrical analytical node.
Remarks:
If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
upstreamNodeId:
The upstream electrical analytical node id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not an electrical analytical node id.
-or-
The area based load can not connect to the upstream electrical analytical node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.GetUpstreamNodeId
Gets the upstream electrical analytical node id.
Remarks:
If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
Returns:
The upstream node id.
Since:
2024

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.GetElectricalLoadAreas
Gets electrical load areas which the area based load includes.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.RemoveElectricalLoadArea(Autodesk.Revit.DB.ElementId)
Removes electrical load area from the area based load.
electricalLoadAreaId:
The electrical load area id to remove.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.AddElectricalLoadArea(Autodesk.Revit.DB.ElementId)
Adds electrical load area into the area based load.
electricalLoadAreaId:
The electrical load area id to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id isn't a valid electrical load area.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.Current
The current of the area based load .
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.Voltage
The voltage of the area based load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.ApparentPowerDensity
The apparent power density of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.LoadType
The load type of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.ApparentLoad
The electrical apparent load of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.PowerFactor
The power factor of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.TrueLoad
The electrical true load of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.LoadClassification
The load classification of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.LoadDensity
The load density of the area based load.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.AreaBasedLoadType
The electrical area based load type of the area based load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id isn't a valid area based load type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData.PhasesNumber
The Phases Number of the area based load.
Remarks:
This property is used to retrieve the Phases Number.
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadData
Represents the electrical area based load data.
Since:
2023